Documents/ЗаявкаНаПоездку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПоездку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БалансПассажиров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пассажир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поездка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поездка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БалансПассажиров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>БалансПассажиров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Деньги</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пассажир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Поездка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Поездка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БалансВодителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПоездки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободныеМеста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пассажиры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пассажир</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаПоездку/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОтклонитьНаСервере()
	Объект.СтатусЗаявки = Перечисления.СтатусыЗаявки.Отклонена;
	КонецПроцедуры
	
	
&НаКлиенте
Процедура Отклонить(Команда)
	ОтклонитьНаСервере();    
	ЭтаФорма.Записать();  
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаСервере
Процедура ОдобритьНаСервере() 
	// меняем статус
	Объект.СтатусЗаявки = Перечисления.СтатусыЗаявки.Принята;	
	ИзменяемаяПоездка = Объект.Поездка.ПолучитьОбъект(); 
	// уменьшаем свободные места 
	ИзменяемаяПоездка.СвободныеМеста = ИзменяемаяПоездка.СвободныеМеста - 1;
	// добавляем пассажира
   	НовыйПассажир = ИзменяемаяПоездка.Пассажиры.Добавить();
  	НовыйПассажир.Пассажир = Объект.Пассажир; 
	ИзменяемаяПоездка.Записать(); 
	
КонецПроцедуры


&НаКлиенте
Процедура Одобрить(Команда)   
	Если ПолучитьСвободныеМеста(Объект.Поездка) = 0 Тогда
		ОтклонитьВсеЗаявкиНаПоездку(); 
	Иначе 
		Если ПолучитьСвободныеМеста(Объект.Поездка) = 1 Тогда 
			ОдобритьНаСервере();
			ЭтаФорма.Записать();
			ОтклонитьВсеЗаявкиНаПоездку();
		Иначе 
			ОдобритьНаСервере();
		КонецЕсли; 
	КонецЕсли; 
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаСервере
Функция НаПроездкуЕстьМеста ()
    Возврат Объект.Поездка.СвободныеМеста > 0;
КонецФункции   

 
&НаСервере
Процедура ОтклонитьВсеЗаявкиНаПоездку() 	
	ТекстЗапроса = "ВЫБРАТЬ ДокументЗаявкаНаПоездку.Ссылка КАК Ссылка ИЗ Документ.ЗаявкаНаПоездку КАК ДокументЗаявкаНаПоездку ГДЕ ДокументЗаявкаНаПоездку.СтатусЗаявки = &СтатусЗаявки И ДокументЗаявкаНаПоездку.Поездка = &Поездка" ;
    Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СтатусЗаявки", Перечисления.СтатусыЗаявки.Новая);
	Запрос.УстановитьПараметр("Поездка", Объект.Поездка);
	ЗаявкиНаПоездку = Запрос.Выполнить().Выбрать();
	Пока ЗаявкиНаПоездку.Следующий() Цикл
		ТекПоездка = ЗаявкиНаПоездку.Ссылка.ПолучитьОбъект();     
		Если ТекПоездка.СтатусЗаявки <> Перечисления.СтатусыЗаявки.Принята Тогда
			ТекПоездка.СтатусЗаявки = Перечисления.СтатусыЗаявки.Отклонена;  
			ТекПоездка.Записать();
		КонецЕсли;
	КонецЦикла;   	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПользовательЯвляетсяПассажиром() И НЕ ЗначениеЗаполнено(Объект.Пассажир) Тогда
		Объект.Пассажир = ПолучитьИмяПассажира();
		Объект.СтатусЗаявки = ПолучитьСтатусЗаявкиНовый();
	Иначе
		Элементы.КомандаОткрытьФормуВыбораПоездки.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры      


&НаСервереБезКонтекста
Функция ПолучитьИмяПассажира()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьСтатусЗаявкиНовый()
	Возврат Перечисления.СтатусыЗаявки.Новая;
КонецФункции


&НаСервереБезКонтекста
Функция ПользовательЯвляетсяПассажиром()
	Возврат РольДоступна("Пассажир");	
КонецФункции


&НаКлиенте
Процедура КомандаОткрытьФормуВыбораПоездки(Команда)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Завершена", Ложь);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПоездки", ЭтаФорма);
	ОткрытьФорму("Документ.Поездка.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОписаниеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры         


&НаСервере
Функция ЕстьЗаявкаНаПоездку(Поездка)
	СписокПоездокСЗаявками = Новый Массив;
    Запрос = Новый Запрос("ВЫБРАТЬ Документ.ЗаявкаНаПоездку.Поездка ИЗ Документ.ЗаявкаНаПоездку ГДЕ Пассажир = &Пассажир");
    Запрос.УстановитьПараметр("Пассажир", ПолучитьИмяПассажира());
    РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        СписокПоездокСЗаявками.Добавить(Выборка.Поездка);
	КонецЦикла;
	Возврат НЕ СписокПоездокСЗаявками.Найти(Поездка) = Неопределено;
КонецФункции


&НаКлиенте
Процедура ОбработатьВыборПоездки(РезультатЗакрытия, ДопПараметры) Экспорт
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Если ПолучитьСвободныеМеста(РезультатЗакрытия) = 0 Тогда
		Предупреждение("В этой поездке нет свободных мест");
		Объект.Поездка = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если НЕ ДостаточноСредствНаБалансе(РезультатЗакрытия) Тогда
		Предупреждение("Недостаточно средств на балансе");
		Объект.Поездка = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если ЕстьЗаявкаНаПоездку(РезультатЗакрытия) Тогда
		Предупреждение("Вы уже подавали заявку на эту поездку");
		Объект.Поездка = Неопределено;
		Возврат;
	КонецЕсли;
	
	Объект.Поездка = РезультатЗакрытия;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСвободныеМеста(Поездка)
	Возврат Поездка.СвободныеМеста;
КонецФункции


&НаСервереБезКонтекста
Функция ДостаточноСредствНаБалансе(Поездка)
	Возврат РегистрыНакопления.БалансПассажиров.ПолучитьБаланс() >= Поездка.СтоимостьПоездки
КонецФункции
